---
kind: property
id: P:Autodesk.Revit.DB.CADLinkOptions.PreserveOverrides
source: html/91a559a5-75ed-398d-b0c5-67a9962b652d.htm
---
# Autodesk.Revit.DB.CADLinkOptions.PreserveOverrides Property

Whether Revit should preserve the link's graphic overrides on reload.

## Syntax (C#)
```csharp
public bool PreserveOverrides { get; set; }
```